"{\n \"Questions\": [\n  \"{\\n  \\\"parameter_1\\\": [\\n    \\\"1. What is the full form of CSE? (A) Computer Science Engineering (B) Cyber Security Engineering (C) Computer Systems Engineering (D) Computer Science Education2. Which of the following is not a programming language? (A) C++ (B) Python (C) HTML (D) Java\\\"\\n  ]\\n}\",\n  \"{\\n  \\\"parameter_2\\\": [\\n    \\\"Listening:\\\",\\n    \\\"1. What is the main difference between listening and hearing?\\\",\\n    \\\"(A) Listening is passive, while hearing is active.\\\",\\n    \\\"(B) Listening is active, while hearing is passive.\\\",\\n    \\\"2. What are some strategies for improving your listening skills?\\\",\\n    \\\"(A) Avoid distractions, pay attention to the speaker, and ask questions if you don't understand.\\\",\\n    \\\"(B) Ignore distractions, pay attention to the speaker, and ask questions if you don't understand.\\\",\\n    \\\"\\\",\\n    \\\"Reading:\\\",\\n    \\\"1. What are the main types of reading?\\\",\\n    \\\"(A) Skimming, scanning, and intensive reading.\\\",\\n    \\\"(B) Intensive reading, skimming, and scanning.\\\",\\n    \\\"2. What are some strategies for improving your reading comprehension?\\\",\\n    \\\"(A) Read actively, preview the text, and use context clues to figure out unfamiliar words.\\\",\\n    \\\"(B) Read passively, preview the text, and use context clues to figure out unfamiliar words.\\\",\\n    \\\"\\\",\\n    \\\"Writing:\\\",\\n    \\\"1. What are the main types of writing?\\\",\\n    \\\"(A) Narrative, expository, and persuasive writing.\\\",\\n    \\\"(B) Expository, persuasive, and narrative writing.\\\",\\n    \\\"2. What are some strategies for improving your writing skills?\\\",\\n    \\\"(A) Write regularly, get feedback on your writing, and use a variety of writing styles.\\\",\\n    \\\"(B) Write irregularly, get feedback on your writing, and use a variety of writing styles.\\\",\\n    \\\"\\\",\\n    \\\"Speaking:\\\",\\n    \\\"1. What are the main types of speaking?\\\",\\n    \\\"(A) Formal, informal, and public speaking.\\\",\\n    \\\"(B) Informal, public, and formal speaking.\\\",\\n    \\\"2. What are some strategies for improving your speaking skills?\\\",\\n    \\\"(A) Practice regularly, speak clearly and confidently, and use gestures to emphasize your points.\\\",\\n    \\\"(B) Practice irregularly, speak clearly and confidently, and use gestures to emphasize your points.\\\"\\n  ]\\n}\",\n  \"{\\n  \\\"parameter_3\\\": [\\n    \\\"Quantitative Aptitude\\\",\\n    \\\"\\\",\\n    \\\"1. A train 150 m long crosses a platform 180 m long in 20 sec. Find the speed of the train in km/hr.\\\",\\n    \\\"(A) 45\\\",\\n    \\\"(B) 48\\\",\\n    \\\"(C) 50\\\",\\n    \\\"(D) 60\\\",\\n    \\\"2. If 3x + 2y = 29 and 2x + 3y = 23, then find the value of x + y.\\\",\\n    \\\"(A) 10\\\",\\n    \\\"(B) 12\\\",\\n    \\\"(C) 14\\\",\\n    \\\"(D) 16\\\",\\n    \\\"\\\",\\n    \\\"Analytical Reasoning\\\",\\n    \\\"\\\",\\n    \\\"1. A man goes to a shop and buys a bag for Rs. 250. He pays Rs. 50 cash and the rest of the amount on credit. If the rate of interest is 20% per annum, then the total amount he will have to pay after 3 years is:\\\",\\n    \\\"(A) 350\\\",\\n    \\\"(B) 370\\\",\\n    \\\"(C) 390\\\",\\n    \\\"(D) 410\\\",\\n    \\\"2. A train running at the speed of 60 km/hr crosses a pole in 9 seconds. What is the length of the train?\\\",\\n    \\\"(A) 120 m\\\",\\n    \\\"(B) 150 m\\\",\\n    \\\"(C) 180 m\\\",\\n    \\\"(D) 270 m\\\"\\n  ]\\n}\",\n  \"{\\n  \\\"parameter_4\\\": [\\n    \\\"Group Activities\\\",\\n    \\\"\\\",\\n    \\\"1. Which of the following is not a benefit of group activities?\\\",\\n    \\\" (A) Increased productivity\\\",\\n    \\\" (B) Improved learning\\\",\\n    \\\" (C) Increased social interaction\\\",\\n    \\\" (D) Reduced stress\\\",\\n    \\\"\\\",\\n    \\\"2. Which of the following is the best way to structure a group activity?\\\",\\n    \\\" (A) Assign each member a specific role\\\",\\n    \\\" (B) Allow members to choose their own roles\\\",\\n    \\\" (C) Have the group decide on their own roles\\\",\\n    \\\" (D) Have the instructor assign roles to the group\\\",\\n    \\\"\\\",\\n    \\\"Peer Feedback\\\",\\n    \\\"\\\",\\n    \\\"1. Which of the following is not a benefit of peer feedback?\\\",\\n    \\\" (A) It can help students identify their strengths and weaknesses\\\",\\n    \\\" (B) It can help students learn from each other\\\",\\n    \\\" (C) It can help students build relationships with their classmates\\\",\\n    \\\" (D) It can help students improve their grades\\\",\\n    \\\"\\\",\\n    \\\"2. Which of the following is the best way to give peer feedback?\\\",\\n    \\\" (A) Be honest and constructive\\\",\\n    \\\" (B) Be critical and negative\\\",\\n    \\\" (C) Be supportive and encouraging\\\",\\n    \\\" (D) Be indifferent and neutral\\\"\\n  ]\\n}\",\n  \"{\\n  \\\"parameter_5\\\": [\\n    \\\"Adaptability\\\",\\n    \\\"1. Which of the following is not a characteristic of adaptable people?\\\",\\n    \\\"(A) They are flexible\\\",\\n    \\\"(B) They are able to change\\\",\\n    \\\"(C) They are easily frustrated\\\",\\n    \\\"(D) They are open to new ideas\\\",\\n    \\\"2. Which of the following situations would require adaptability?\\\",\\n    \\\"(A) Getting a new job\\\",\\n    \\\"(B) Moving to a new city\\\",\\n    \\\"(C) Starting a new relationship\\\",\\n    \\\"(D) All of the above\\\",\\n    \\\"\\\",\\n    \\\"Continous learning\\\",\\n    \\\"1. Which of the following is not a benefit of continuous learning?\\\",\\n    \\\"(A) It can help you advance your career\\\",\\n    \\\"(B) It can make you more interesting to others\\\",\\n    \\\"(C) It can make you more creative\\\",\\n    \\\"(D) It can make you more stressed\\\",\\n    \\\"2. Which of the following is a good way to stay motivated to learn continuously?\\\",\\n    \\\"(A) Set goals for yourself\\\",\\n    \\\"(B) Find a mentor\\\",\\n    \\\"(C) Take classes\\\",\\n    \\\"(D) All of the above\\\"\\n  ]\\n}\",\n  \"{\\n  \\\"parameter_6\\\": [\\n    \\\"Prioritization tasks and setting clear goals\\\",\\n    \\\"\\\",\\n    \\\"1. Which of the following is NOT a good way to prioritize tasks?\\\",\\n    \\\" (A) Start with the most important tasks.\\\",\\n    \\\" (B) Work on the tasks that are easiest to complete.\\\",\\n    \\\" (C) Work on the tasks that are due the soonest.\\\",\\n    \\\" (D) Work on the tasks that you enjoy the most.\\\",\\n    \\\"\\\",\\n    \\\"2. Which of the following is a good way to set clear goals?\\\",\\n    \\\" (A) Make sure your goals are specific, measurable, achievable, relevant, and time-bound.\\\",\\n    \\\" (B) Make sure your goals are vague and general.\\\",\\n    \\\" (C) Make sure your goals are easy to achieve.\\\",\\n    \\\" (D) Make sure your goals are fun to work towards.\\\",\\n    \\\"\\\",\\n    \\\"Estimation of time required for tasks and setting deadlines\\\",\\n    \\\"\\\",\\n    \\\"1. Which of the following is NOT a good way to estimate the time required for a task?\\\",\\n    \\\" (A) Ask someone who has done a similar task before.\\\",\\n    \\\" (B) Look up the average time it takes to complete the task online.\\\",\\n    \\\" (C) Make a guess and hope for the best.\\\",\\n    \\\" (D) Add a buffer to your estimate to account for unexpected delays.\\\",\\n    \\\"\\\",\\n    \\\"2. Which of the following is a good way to set deadlines for tasks?\\\",\\n    \\\" (A) Set deadlines that are too tight to be realistic.\\\",\\n    \\\" (B) Set deadlines that are too lenient and allow yourself plenty of time.\\\",\\n    \\\" (C) Set deadlines that are challenging but achievable.\\\",\\n    \\\" (D) Set deadlines that are flexible and can be adjusted as needed.\\\",\\n    \\\"\\\",\\n    \\\"Handling multitasking and managing multiple assignments\\\",\\n    \\\"\\\",\\n    \\\"1. Which of the following is NOT a good way to handle multitasking?\\\",\\n    \\\" (A) Focus on one task at a time and avoid switching between tasks.\\\",\\n    \\\" (B) Break down large tasks into smaller, more manageable tasks.\\\",\\n    \\\" (C) Set priorities for your tasks and work on the most important ones first.\\\",\\n    \\\" (D) Use a to-do list or project management software to keep track of your tasks.\\\",\\n    \\\"\\\",\\n    \\\"2. Which of the following is a good way to manage multiple assignments?\\\",\\n    \\\" (A) Try to complete all of your assignments at the same time.\\\",\\n    \\\" (B) Focus on one assignment at a time and complete it before moving on to the next one.\\\",\\n    \\\" (C) Set deadlines for each of your assignments and work on them in order of due date.\\\",\\n    \\\" (D) Use a project management tool to keep track of your assignments and deadlines.\\\",\\n    \\\"\\\",\\n    \\\"Understanding project life cycles, from initiation to completion\\\",\\n    \\\"\\\",\\n    \\\"1. Which of the following is NOT a phase of the project life cycle?\\\",\\n    \\\" (A) Initiation\\\",\\n    \\\" (B) Planning\\\",\\n    \\\" (C) Execution\\\",\\n    \\\" (D) Termination\\\",\\n    \\\"\\\",\\n    \\\"2. Which of the following is a good way to ensure that a project is completed on time and within budget?\\\",\\n    \\\" (A) Create a detailed project plan and stick to it.\\\",\\n    \\\" (B) Delegate tasks to others and let them take care of them.\\\",\\n    \\\" (C) Make sure to have plenty of resources available.\\\",\\n    \\\" (D) All of the above choices.\\\",\\n    \\\"\\\",\\n    \\\"Utilization of tools or software related to time and project management\\\",\\n    \\\"\\\",\\n    \\\"1. Which of the following is NOT a tool or software that can be used for time and project management?\\\",\\n    \\\" (A) Microsoft Project\\\",\\n    \\\" (B) Google Calendar\\\",\\n    \\\" (C) Trello\\\",\\n    \\\" (D) A paper planner\\\",\\n    \\\"\\\",\\n    \\\"2. Which of the following is a good way to use tools or software to help you manage your time and projects?\\\",\\n    \\\" (A) Use them only when you absolutely need to.\\\",\\n    \\\" (B) Use them to track your progress and stay on top of your tasks.\\\",\\n    \\\" (C) Use them to create detailed project plans and Gantt charts.\\\",\\n    \\\" (D) All of the above choices.\\\"\\n  ]\\n}\",\n  \"{\\n  \\\"parameter_7\\\": [\\n    \\\"Scenario-based questions on professional conduct\\\",\\n    \\\"\\\",\\n    \\\"1. You are working on a project with a colleague who is consistently late to meetings and does not meet deadlines. How would you handle this situation?\\\",\\n    \\\" A. Confront your colleague directly about their behavior.\\\",\\n    \\\" B. Talk to your manager about the situation.\\\",\\n    \\\" C. Let it go and focus on your own work.\\\",\\n    \\\" D. All of the above.\\\",\\n    \\\"\\\",\\n    \\\"2. You are asked to give a presentation to a group of executives. You are nervous and do not know much about the topic. How would you prepare for this presentation?\\\",\\n    \\\" A. Do your research and practice your presentation.\\\",\\n    \\\" B. Ask someone else to give the presentation for you.\\\",\\n    \\\" C. Wing it and hope for the best.\\\",\\n    \\\" D. All of the above.\\\",\\n    \\\"\\\",\\n    \\\"Setting up Mock interview sessions on our Platform\\\",\\n    \\\"\\\",\\n    \\\"1. You want to set up a mock interview session on our Platform. How would you do this?\\\",\\n    \\\" A. Go to the \\\\\\\"Mock Interviews\\\\\\\" section of the Platform and click on the \\\\\\\"Create a Mock Interview\\\\\\\" button.\\\",\\n    \\\" B. Email us at [email protected] and ask us to set up a mock interview for you.\\\",\\n    \\\" C. Call us at 1-800-555-1212 and ask us to set up a mock interview for you.\\\",\\n    \\\" D. All of the above.\\\",\\n    \\\"\\\",\\n    \\\"2. You are setting up a mock interview session on our Platform for a candidate who is applying for a job as a software engineer. What questions would you ask the candidate?\\\",\\n    \\\" A. Questions about the candidate's experience and skills.\\\",\\n    \\\" B. Questions about the candidate's personality and fit for the company.\\\",\\n    \\\" C. Questions about the candidate's salary expectations.\\\",\\n    \\\" D. All of the above.\\\"\\n  ]\\n}\"\n ]\n}"